
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"9ad0173684f487c16117600c1a91a0bb852cbaad51d4942790431ce4dc3e7936\"" -> "W/\"e7b9854cf30b9a07018cc5dcaea614e5f69b666969d9232702ae647fcedc17e6\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"d2c8a817da76d69bd31a5ac5ea918c4f22703c819dc4bc0979babb54ac63f16e\"" -> "W/\"3c363027b0956d5e716bfe554bf8e5ad295c197aed4e468184baf9f561ab17b5\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-docker"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"9953fb8943ffbb9b9980d165aea3ce6c35e6ecffbfd41b70890e0c6973b44a2c\"" -> "W/\"52265c4f58dd0dae741f7fa2ec7b96c29c369e9b301011e25414afd4ee213996\""
        id                          = "kong-docker"
        name                        = "kong-docker"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"0b5b913217ed090f88d49a63e107b30b463e6244d1794f30605984ad1598d70d\"" -> "W/\"7cd2e2b2b4f7b00b8fb12c626fa87fa787fd5a28f17175ceb9e57834dd93324b\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"1ad0faf69a53114358f968154c7bfae200467cfef713b64bb03039fd008d5280\"" -> "W/\"10387ed923a9dca2af362c0362cd9fc3946a940860ab8e3551e1c0fc58a98add\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"e94a5c57f696057ee889db0998e7767f818b5d334218eb33795c031609bb0251\"" -> "W/\"1404e58e6e4beeb7e2bae79c7a14ac16636a0d8e5e8fc0e13fc42f40b08057fd\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"834a3267e225ba50b7625a208124b91c3a5421d0d86c2a321732d09306bddf82\"" -> "W/\"e3aec12b5e7eddcdcb207c73e51768b0ffd063347e06ba317fa87e5696338764\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"677804f08c548d0050228dc6d59626f8fc0c78917dbb79842aa98b068c18afc1\"" -> "W/\"05cc9bb8a5592fde0e8ff248e8119dfbedabacb384fe80fb024289976c30c407\""
        id                          = "template-template"
        name                        = "template-template"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_private_all["kong-test-suite"] has changed
  ~ resource "github_repository" "settings_private_all" {
      ~ etag                        = "W/\"31f1eb02753697edc68876441b97d6853da5f217557d2f3d6997217cc714fb95\"" -> "W/\"0e4915f544873b787e7c60b44a568440102da892ffa037755390cf7b268b7577\""
        id                          = "kong-test-suite"
        name                        = "kong-test-suite"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"855f6e1182440be830647c954c79c27149323e0fc31155f07b6e40c7e7025e2f\"" -> "W/\"b09ce92df02544b60aa9071878d7cbc5bbf8637a48ab52c76c774fccbdb201c6\""
        id          = "1481994"
        name        = "protect-main-branch-atc-router-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"2572bb503c28498e58a702e6db770b69f66160f7ecbc8577d14222dff234b580\"" -> "W/\"e2f63d839514ac68b25b01a4d3e1200b0e295c3a13d0af0d205d09a069c9d864\""
        id          = "1430804"
        name        = "protect-main-branch-kong-build-images-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"28a7d5c6dbaec001c4187d06e736a8b49206e4b904a17be8fc5ee74a11805a23\"" -> "W/\"a5308154173d489497b789eecf33f43b985bdfbf599c951ec19502c42c2921da\""
        id          = "1430806"
        name        = "protect-main-branch-kong-development-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"3e4abc30648d9fd660a168272ef39a19f5a79b8dfa96aa86c96044dd086cf87e\"" -> "W/\"16fb953e14c22b01ccb7464ccc0e7448582918da5eea8c96699a2491bf97b434\""
        id          = "1491043"
        name        = "protect-main-branch-kong-docker-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"4c1efab1e5eed358a794cfc0f2d83b33dfe1b5ac9264edd6864155e868124796\"" -> "W/\"30f626f50a804da6d3d4e49a9715ad45ae29a12b812f09e29a27395a3773dc54\""
        id          = "1430805"
        name        = "protect-main-branch-kong-openssl-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"f153537fab248170d61592f992c7ef027450b2d7ad41581e1a1616eb78c8a355\"" -> "W/\"4a1510412939eacb0eb40d32b17f2ca7af0946e4411ab819ff607d3e20f65755\""
        id          = "1430802"
        name        = "protect-main-branch-kong-package-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"eedce5495a8c8a9002a865aee1b99b704280ce31e9b3d05dded45b06127ea63d\"" -> "W/\"9925482a70d1e033cb9575e29e072f6306ed7e7e7cae1507b0070403de72e808\""
        id          = "1430818"
        name        = "protect-main-branch-kong-runtime-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_all" {
      - enforcement = "active" -> null
      - etag        = "W/\"61aa014b3861fc3f5b4a7da6cd8db79a2e6ddc1694549d65ba83113335344b4b\"" -> null
      - id          = "1482348" -> null
      - name        = "protect-main-branch-kong-test-suite-pre-commit-20240828-070806" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4ycD9xzgAWnmw" -> null
      - repository  = "kong-test-suite" -> null
      - ruleset_id  = 1482348 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "pre-commit" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"c6744e4d931ad144ec06c7fa16c346389aa497b561409c97aff7539a75263229\"" -> "W/\"e54017ad2b6c1efa77c5104946ace98c6856864fc2b0d29d3e87297b960d0a8e\""
        id          = "1430817"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"c332c0fb52f09f563a1f34ab4379f794e327490412a4c3203982d9a1f3725815\"" -> "W/\"9424407e4495cc54c97dbdcf99ef5d7471881f879e5ae72c9fa48782eb7f0774\""
        id          = "1430803"
        name        = "protect-main-branch-template-1-github-release-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"0e52d58674b11526103d22a8c0156e53c5f7ede2f7f159f2d940638bd127acf9\"" -> "W/\"592d6f606162284cc34d12ee4af05a33e0e7aad0018b6d1a27c0e941cf45f518\""
        id          = "1430814"
        name        = "protect-main-branch-template-1-terraform-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"993af77143a9c2ab7d2e61fe56c23969368c59cc9cf7d5571b8b9f7e97927b17\"" -> "W/\"9b3a1dd9685c877b008ae3ad8aad01977455273ec24d55bcbeed503999064dcb\""
        id          = "1430815"
        name        = "protect-main-branch-template-template-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"2741ae4e02ebbac3f8edafd9a15ab18503e36f7867b4efd167df6bfd2d04459e\"" -> "W/\"cf5049155c220b7e3a4ed565496cb5a1dc2ae19ade20b5479118cc746338a9e9\""
        id          = "1430807"
        name        = "protect-main-branch-terraform-github-pre-commit-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"7eff9ec4f43ba73362c3fa2214438a0a8b5f7dda1271332e8c683ceefc618b61\"" -> "W/\"c11d30a19ff0e7c437224eb2b5571176349efab75652a78f9a0b2499b7741952\""
        id          = "1430869"
        name        = "protect-main-branch-kong-build-images-release-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"539c5ba190ff33bec25f3ce493926e8d58164e34a6e956a92751e098625252da\"" -> "W/\"6515722ec8ff1cf50e6363f147391998c95dc3923894e62c264dbd436020c3b9\""
        id          = "1430871"
        name        = "protect-main-branch-kong-development-release-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"2d0e8845f479218dbee76846d5345f2d4e9a0cdc45bccdd0c6f4b92a0737faf5\"" -> "W/\"e0cbafcca630b28d6112060c3ca01241d5bf92612d25705bdf47b9b27217bea4\""
        id          = "1491044"
        name        = "protect-main-branch-kong-docker-release-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"5269b5f0af0d28addcd49fa535b50b2e93e42031fb3fffdbcc889e23eaeffb3b\"" -> "W/\"d4cdbb47048fff87438b9d8d488cc8a05ad8c13a4685c91003bab262c8c55ac4\""
        id          = "1430870"
        name        = "protect-main-branch-kong-openssl-release-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"226a6b88db5247229a0e0ce5df6507c814042e4ec430b49cae4b2bbf961a405c\"" -> "W/\"49e2d8fa49e34ae568056b3e36686f1a1b5a7687fcf1610d9b0bc13d92e0eb38\""
        id          = "1430873"
        name        = "protect-main-branch-kong-package-release-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"c3a16246976df8fda4ef61b8f08ca48b12e8e503ef603334daa4ca53d737c4e8\"" -> "W/\"465ba51b8ae7b44d0eda7495fd5ff5deda41c8aa08009463f97ea917c24f44f3\""
        id          = "1430868"
        name        = "protect-main-branch-kong-runtime-release-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_kong" {
      - enforcement = "active" -> null
      - etag        = "W/\"c154c958e2713912a62d3f36ed744e4d9259485212456d25ee19bca05985d328\"" -> null
      - id          = "1482346" -> null
      - name        = "protect-main-branch-kong-test-suite-release-20240828-070806" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4ycD9xzgAWnmo" -> null
      - repository  = "kong-test-suite" -> null
      - ruleset_id  = 1482346 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "Done" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"69ff8a07872d288ef55ba25f3495ac6102a02f85f066b9b14e00ad2a408d573b\"" -> "W/\"6dbac700d7bb8ada51abee5368f213396f1a93533a1d82c2d803e5bbfd4145a0\""
        id          = "1430872"
        name        = "protect-main-branch-multi-arch-fpm-release-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"69f6c8f3d4e1b11bfc4306f80280e9d55c675f09fea949315c750919d0eb330a\"" -> "W/\"a71d4aab027e512fffe175775769e7f52c589a196da3fda2928b7412f5c10823\""
        id          = "1431038"
        name        = "protect-main-branch-template-1-github-release-release-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"93fd913a2af1df929405e6429df34c21d539614f980f8e200e417bffc78fb396\"" -> "W/\"eb8af92a98f6d8f62dde8f308b83d0a5c68bd6ecf471c3dc1abe8b058b0e0f46\""
        id          = "1430865"
        name        = "protect-main-branch-template-1-terraform-terraform-plan-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"9ca0a798de326220d89f79736a58f112a0efce2f10e52c898a669d3613fb03ec\"" -> "W/\"83ff34cf89d8aa1ea18c038ad496ed2a1c143eaf2dee9b5e1f77061ffb593bd4\""
        id          = "1430864"
        name        = "protect-main-branch-terraform-github-terraform-plan-20240828-070806"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.settings_private_all["kong-fuzzy-testing"] will be created
  + resource "github_repository" "settings_private_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-fuzzy-testing"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-template"
        }
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1481994"
      ~ name        = "protect-main-branch-atc-router-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430804"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430806"
      ~ name        = "protect-main-branch-kong-development-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-docker"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1491043"
      ~ name        = "protect-main-branch-kong-docker-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430805"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430802"
      ~ name        = "protect-main-branch-kong-package-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430818"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-test-suite"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-test-suite"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430817"
      ~ name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430803"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430814"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430815"
      ~ name        = "protect-main-branch-template-template-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430807"
      ~ name        = "protect-main-branch-terraform-github-pre-commit-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430869"
      ~ name        = "protect-main-branch-kong-build-images-release-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430871"
      ~ name        = "protect-main-branch-kong-development-release-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-docker"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1491044"
      ~ name        = "protect-main-branch-kong-docker-release-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430870"
      ~ name        = "protect-main-branch-kong-openssl-release-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430873"
      ~ name        = "protect-main-branch-kong-package-release-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430868"
      ~ name        = "protect-main-branch-kong-runtime-release-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-test-suite"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "kong-test-suite"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430872"
      ~ name        = "protect-main-branch-multi-arch-fpm-release-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1431038"
      ~ name        = "protect-main-branch-template-1-github-release-release-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430865"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430864"
      ~ name        = "protect-main-branch-terraform-github-terraform-plan-20240828-070806" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 22 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->